* Overview of available controllers
** MIDI controls of LIVID code interface:
*** Physical orientation - placement of device in relation to performer

NOTE: Place device with plain long side towards the player (self) and cutout "code" logo towards the audience (outwards).
*** Knobs (Dials)

32 knobs, in 4 rows of 8 knobs each.

Then, the knobs send the following MIDI commands:

Starting on the upper left corner, and proceeding:
- First down the rows (rows 1, 2, 3, 4 on the first column)
- Then down columns (columns 1 - 8)

All knobs send on Channel 0, type control (CC) and numbers 1 to 32

Table arrangement of knobs and their control number correspondence:

| 1 | 5 |  9 | 13 | 17 | 21 | 25 | 29 |
| 2 | 6 | 10 | 14 | 18 | 22 | 26 | 30 |
| 3 | 7 | 11 | 15 | 19 | 23 | 27 | 31 |
| 4 | 8 | 12 | 16 | 20 | 24 | 28 | 32 |
#+TBLFM: $2=$-1+4::$3=$-1+4::$4=$-1+4::$5=$-1+4::$6=$-1+4::$7=$-1+4::$8=$-1+4
*** Knob-Buttons

Each knob is also a button - when pressed on top.  These buttons send note-on / note-off messages when pressed - released.  They send on channel 0, nums (notes) 1 to 32, as follows:

| 1 | 5 |  9 | 13 | 17 | 21 | 25 | 29 |
| 2 | 6 | 10 | 14 | 18 | 22 | 26 | 30 |
| 3 | 7 | 11 | 15 | 19 | 23 | 27 | 31 |
| 4 | 8 | 12 | 16 | 20 | 24 | 28 | 32 |

*** Buttons

The buttons send NoteOn and NoteOff messages on press/release, all on channel 0.

The key numbers are:

| 33 |    |    |    |    |    |    |    |    |
| 34 |    |    |    |    |    |    |    |    |
| 35 |    |    |    |    |    |    |    |    |
| 36 |    |    |    |    |    |    |    |    |
| 37 | 38 | 39 | 40 | 41 | 42 | 43 | 44 | 45 |
#+TBLFM: $1=@-1 + 1::@1$1=33

** MIDI controls for JLCooper CS-32

*** Buttons

Note: Total number of main buttons on rows x 2 control message assignments per button (light indicator on and off states):

|-------------------------+-----|
| buttons per row         |  16 |
| number of rows          |   6 |
| x 2 controls per button |   2 |
|-------------------------+-----|
|                         | 192 |
|-------------------------+-----|
#+TBLFM: @4$2=vprod(@-II..@-I)

192 buttons, in two goups of 96 buttons each!

**** State 1 (light indicator off)

From left to right and top to bottom, first horizontally along the columns and then vertically down the rows:

Top left: chan 14, num 48, val 0/127

   (---------- TOP ROW GROUP ----------)
1. Row 1: Chan 14, nums 48-63
2. Row 2: Chan 13, nums 112-127
3. Row 3: Chan 13, nums 48-127
   (---------- BOTTOM ROW GROUP ---------)
4. Row 4: Chan 14, nums 32-47
5. Row 5: Chan 13, nums 96-111
6. Row 6: Chan 13, nums 32-47


**** State 2 (light indicator on)

   (---------- TOP ROW GROUP ----------)
1. Row 1: Chan 14, nums 16-31
2. Row 2: Chan 13, nums 80-95
3. Row 3: Chan 13, nums 16-31
   (---------- BOTTOM ROW GROUP ---------)
4. Row 4: Chan 14, nums 0-15
5. Row 5: Chan 13, nums 64-79
6. Row 6: Chan 13, nums 0-15

*** Sliders

32 sliders, in 2 rows of 16 sliders each

1. Top row: Control (CC), channel 15, nums 16-31
2. Bottom row: Control (CC), channel 15, nums 0-15
* Assignments
** Blips on Livid

Blip "Multi" 0-7:
On Livid Code controller knobs:

Columns 1 to 8 correspond to Multi0 - Multi7.
Rows are:
1. (Top row:) y (elevation)
2. (second row:) x (azimuth)
3. width
4. level (vol)
** Voices on JLCooper
*** Ma: Top row
**** Knobs
1. global vol
2. x
3. y

**** Sliders:
1. q
2. width
3. resonz freq
4. resonz lfnoise rate
5. resonz lfnoise lo
6. resonz lfnoise hi
7. ------------ EMPTY ---------
8. ------------ EMPTY ---------
9. vol 1
10. playbuf rate 1
11. vol 2
12. playbuf rate 2
13. vol 3
14. playbuf rate 3
15. vol 4
16. playbuf rate 4


**** Buttons

1 - 4: playbuf 1 - 4

*** Eisitirio: Bottom row
**** Knobs
4. global vol
5. x
6. y

**** Sliders:
1. q
2. width
3. resonz freq
4. resonz lfnoise rate
5. resonz lfnoise lo
6. resonz lfnoise hi
7. ------------ EMPTY ---------
8. ------------ EMPTY ---------
9. vol 1
10. playbuf rate 1
11. vol 2
12. playbuf rate 2
13. vol 3
14. playbuf rate 3
15. vol 4
16. playbuf rate 4

**** Buttons

1 - 4: playbuf 1 - 4
